JC-Toussaint/STM32_NRF24L01-lib-master/Disco_F746G_NRF24L01_LCD_Receiver_v1/Core/Src/radio_demo.c
    // Configure auto retransmit: 10 retransmissions with pause of 2500s in between
    nRF24_SetAutoRetr(nRF24_ARD_2500us, 10);

    // Enable Auto-ACK for pipe#0 (for ACK packets)
    nRF24_EnableAA(nRF24_PIPE0);

    // Set operational mode (PTX == transmitter)
    nRF24_SetOperationalMode(nRF24_MODE_TX);

    // Clear any pending IRQ flags
    nRF24_ClearIRQFlags();

    // Wake the transceiver
    nRF24_SetPowerMode(nRF24_PWR_UP);


    // Some variables
    uint32_t packets_lost = 0; // global counter of lost packets
    uint8_t otx;
    uint8_t otx_plos_cnt; // lost packet count
    uint8_t otx_arc_cnt; // retransmit count


    // The main loop
    payload_length = 10;
    j = 0;
    while (1) {
        // Prepare data packet
        for (i = 0; i < payload_length; i++) {
            nRF24_payload[i] = j++;
            if (j > 0x000000FF) j = 0;
        }

        // Print a payload
        UART_SendStr("PAYLOAD:>");
        UART_SendBufHex((char *)nRF24_payload, payload_length);
        UART_SendStr("< ... TX: ");

        // Transmit a packet
        tx_res = nRF24_TransmitPacket(nRF24_payload, payload_length);
        otx = nRF24_GetRetransmitCounters();
        otx_plos_cnt = (otx & nRF24_MASK_PLOS_CNT) >> 4; // packets lost counter
        otx_arc_cnt  = (otx & nRF24_MASK_ARC_CNT); // auto retransmissions counter
        switch (tx_res) {
            case nRF24_TX_SUCCESS:
                UART_SendStr("OK");
                break;
            case nRF24_TX_TIMEOUT:
                UART_SendStr("TIMEOUT");
                break;
            case nRF24_TX_MAXRT:
                UART_SendStr("MAX RETRANSMIT");
                packets_lost += otx_plos_cnt;
                nRF24_ResetPLOS();
                break;
            default:
                UART_SendStr("ERROR");
                break;
        }
        UART_SendStr("   ARC=");
        UART_SendInt(otx_arc_cnt);
        UART_SendStr(" LOST=");
        UART_SendInt(packets_lost);
        UART_SendStr("\r\n");

        // Wait ~0.5s
        Delay_ms(500);
    }


#endif // DEMO_TX_SINGLE_ESB

}
